machv/esp8266-irrigator/src/main.cpp
#include <FS.h> //this needs to be first
#include <Arduino.h>
#include <WiFiManager.h> 
#include <ESP8266WebServer.h>
#include <PubSubClient.h>         //MQTT server library
#include <EasyButton.h>
#include <ArduinoJson.h>

//for LED status
#include <Ticker.h>
Ticker ticker;

struct Config {
  String mqtt_server;
  int mqtt_port;
  String mqtt_user;
  String mqtt_password;
  String mqtt_channel;
  String relay_1_name;
  String relay_2_name;
};
const char *ConfigFileName = "/config.json";
Config config; 
String mqttTopicRelay1;
String mqttTopicRelay2;

ESP8266WebServer server(80);

// MQTT
WiFiClient espClient;
PubSubClient mqttClient(espClient);
unsigned long lastMqttConnectionRetryTime;
unsigned long mqttReconnectDelay = 30000;

#define PinMeter1 D5
#define PinMeter2 D6
#define PinRelay1 D2
#define PinRelay2 D3
#define PinButton1 D7
#define PinButton2 D8
#define PinLed1 D0
#define PinLed2 D1

bool relay1state = false;
bool relay2state = false;

EasyButton button1(PinButton1);
EasyButton button2(PinButton2);

// The hall-effect flow sensor outputs approximately 4.5 pulses per second per
// litre/minute of flow.
float calibrationFactor = 4.5;

// To store the "rise ups" from the flow meter pulses
volatile uint pulseCounterMeter1 = 0;
volatile uint pulseCounterMeter2 = 0;

float flowRate1;
float flowRate2;

unsigned int flowMilliLitres1;
unsigned int flowMilliLitres2;

unsigned long totalMilliLitres1;
unsigned long totalMilliLitres2;

unsigned long oldTime;

//Interrupt function, so that the counting of pulse “rise ups” dont interfere with the rest of the code  (attachInterrupt)
void meter1_triggered() {
  pulseCounterMeter1++;

  Serial.printf("Trigger 1, current count = %d", pulseCounterMeter1);
  Serial.println();
}
void meter2_triggered() {
  pulseCounterMeter2++;

  Serial.printf("Trigger 2, current count = %d", pulseCounterMeter2);
  Serial.println();
}

void tick() {
  //toggle state
  //int state = digitalRead(LED_BUILTIN);  // get the current state of GPIO1 pin
  //digitalWrite(LED_BUILTIN, !state);     // set pin to the opposite state

  Serial.println("tick");
}

void toggleRelay(int id) {
  uint8_t relayPin = 0;
  uint8_t ledPin = 0;
  String channel;
  
  switch(id) {
    case 1:
      relayPin = PinRelay1;
      ledPin = PinLed1;
      channel = mqttTopicRelay1;
      break;
    case 2:
      relayPin = PinRelay2;
      ledPin = PinLed2;
      channel = mqttTopicRelay2;
      break;
    default:
      return;
      break;
  }

  int currentValue = digitalRead(relayPin);
  int newValue = !currentValue;

  Serial.printf("Toggling relay #%d from %i to %i", id, currentValue, newValue);

  // Do the toggle
  // HIGH (0x1) = OFF, LOW (0x0) = ON
  digitalWrite(relayPin, newValue); // relay
  digitalWrite(ledPin, !newValue); // led
  
  if(id == 1) {
    relay1state = !newValue;
  } else if (id == 2) {
    relay2state = !newValue;
  }

  Serial.println();

  // And publish MQTT update
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing updated state after toggle.");

    String value = String(!newValue); // actual state is negation of the PIN state
    mqttClient.publish(channel.c_str(), value.c_str());
  }
}

void mqttSubscriptionCallback(char* topic, byte* payload, unsigned int length) {
  // report to terminal for debug
  Serial.print("[MQTT] Received message in topic '");
  Serial.print(topic);
  Serial.print("' with content: ");
  for (uint i = 0; i < length; i++) {
    Serial.print((char)payload[i]);
  }
  Serial.println();

  // check if we received topics for state change 
  if (strcmp (mqttTopicRelay1.c_str(), topic) == 0) {
    Serial.printf("Relay 1 state change requested to %c", payload[0]);
    if(
        (payload[0] == '1' && relay1state == false) ||
        (payload[0] == '0' && relay1state == true)
      ) {
        Serial.print(", current state ");
        Serial.print(relay1state);
        Serial.println(" differs -> toggle");
        toggleRelay(1);
    } else {
      Serial.println();
    }
  } else if (strcmp (mqttTopicRelay2.c_str(), topic) == 0) {
    Serial.print("Relay 2 state change requested");
    if(
        (payload[0] == '1' && relay2state == false) ||
        (payload[0] == '0' && relay2state == true)
      ) {
           Serial.print(", current state ");
        Serial.print(relay2state);
        Serial.println(" differs -> toggle");
          toggleRelay(2);
    } else {
      Serial.println();
    }
  }  else {
    Serial.println("[MQTT] No match for any action.");
  }
}

void setupMqtt(int retries) {  
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Disconnecting...");
    mqttClient.disconnect();
  }

  if(config.mqtt_server.length() == 0) {
    return; // no server, no connection needed
  }
  
  mqttTopicRelay1 = String(config.mqtt_channel + "1/state");
  mqttTopicRelay2 = String(config.mqtt_channel + "2/state");

  mqttClient.setServer(config.mqtt_server.c_str(), config.mqtt_port);
  mqttClient.setCallback(mqttSubscriptionCallback);

  int retryCount = 0;
  while (!mqttClient.connected() && retryCount < retries) {
      Serial.print("[MQTT] Connecting (retry #");
      Serial.print(retryCount + 1);
      Serial.println(")...");
  
      bool connectionState = false;
      if(config.mqtt_user.length() > 0) {
        connectionState = mqttClient.connect("Zavlazovac", config.mqtt_user.c_str(), config.mqtt_password.c_str());
      } else {
        connectionState = mqttClient.connect("Zavlazovac");
      }
      
      if (connectionState) {
        Serial.println("[MQTT] Connected successfully.");  
      } else {
        Serial.print("[MQTT] Connection failed with code: ");
        Serial.println(mqttClient.state());
        delay(2000);
      }

      retryCount++;
  }

  // And subscribe to respective channels
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing current states of relays.");
    String value1 = String(relay1state);
    mqttClient.publish(mqttTopicRelay1.c_str(), value1.c_str());
    String value2 = String(relay2state);
    mqttClient.publish(mqttTopicRelay2.c_str(), value2.c_str());

    Serial.println("[MQTT] Subscribing to the channels:");
    Serial.print("  - ");
    Serial.println(mqttTopicRelay1);
    mqttClient.subscribe(mqttTopicRelay1.c_str());
    
    Serial.print("  - ");
    Serial.println(mqttTopicRelay2);
    mqttClient.subscribe(mqttTopicRelay2.c_str());
  }

  lastMqttConnectionRetryTime = millis();
}

void connectMqtt() {
  setupMqtt(5); // By default try 5-times before gave up
}

// Gets called when WiFiManager enters configuration mode
void configModeCallback (WiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  Serial.println(WiFi.softAPIP());
  //if you used auto generated SSID, print it
  Serial.println(myWiFiManager->getConfigPortalSSID());
  
  //entered config mode, make led toggle faster
  //ticker.attach(0.2, tick);
}

String SendStylesheetContent() {
  String ptr;

  ptr +="html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: center;}\n";
  ptr +="body{margin-top: 50px;} h1 {color: #444444;margin: 50px auto 30px;} h3 {color: #444444;margin-bottom: 50px;}\n";
  ptr +=".button {display: block;background-color: #1abc9c;border: none;color: white;padding: 13px 30px;text-decoration: none;font-size: 25px;margin: 0px auto 35px;cursor: pointer;border-radius: 4px;}\n";
  ptr +=".button-on {background-color: #1abc9c;}\n";
  ptr +=".button-on:active {background-color: #16a085;}\n";
  ptr +=".button-off {background-color: #34495e;}\n";
  ptr +=".button-off:active {background-color: #2c3e50;}\n";
  ptr +=".settings-cell {text-align: center; font-size: 14pt; padding: 4px; padding-top: 20px}\n";
  ptr += "th, td {text-align: left; font-size: 12pt}";
  ptr += "input { padding: 5px; font-size: 12pt}";
  ptr +="table {margin: 0 auto; margin-bottom: 20px}\n";
  ptr +="p {font-size: 14px;color: #888;margin-bottom: 10px;}\n";

  return ptr;
}

void handle_stylesheetFile() {
  server.send(200, "text/css", SendStylesheetContent()); 
}

String SendSettingsHTML(){
  Serial.println("Sending Config HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač / Settings</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "</head>\n";
  ptr += "<body><div class=\"page\">\n";
  ptr += "<h1>Zavlažovač</h1>\n";
  ptr += "<h2>Settings</h2>\n";
  
  if(server.hasArg("saved")) {
    ptr += "<div style=\"text-align: center; margin: 20px; font-weight: bold\">Configuration was saved.</div>";
  }

  ptr +="<form method=\"post\" enctype=\"application/x-www-form-urlencoded\">\n";
  ptr +="<table>\n"  
   "<tr>"
    "<th colspan=\"2\" class=\"settings-cell\">Relays</th>"
    "</tr>"
    "  <tr>\n"
    "    <th>Relay 1 Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_1_name\" value=\"" + (config.relay_1_name) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>Relay 2 Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_2_name\" value=\"" + (config.relay_2_name) + "\"></td>\n"
    "  </tr>\n"


  "<tr>"
  "<th colspan=\"2\" class=\"settings-cell\">MQTT Settings</th>"
  "</tr>"
  "  <tr>\n"
  "    <th>Server</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_server\" value=\"" + (config.mqtt_server) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Port</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_port\" value=\"" + (config.mqtt_port) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>User</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_user\" value=\"" + (config.mqtt_user) + "\"></td>\n"
  "  </tr>\n"

    "  <tr>\n"
  "    <th>Password</th>\n"
  "    <td><input type=\"password\" name=\"mqtt_password\" value=\"" + (config.mqtt_password) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Channel prefix</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_channel\" value=\"" + (config.mqtt_channel) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><input class=\"button\" type=\"submit\" value=\"Save Changes\"></th>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><a href=\"/\" class=\"button\">Back</a></th>\n"
  "  </tr>\n"
  "</table>\n";
  
  ptr +="</form>\n"
        "</body>\n"
        "</html>\n";
  
  return ptr;
}

String SendHTML(){
  Serial.println("Sending homepage HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "</head>\n";
  ptr += "<body>\n<div class=\"page\">";
  ptr += "<h1>Zavlažovač</h1>\n";
  
  unsigned int frac;

  ptr += "<div>";
  ptr += "<h2>" + config.relay_1_name + "</h2>";
  ptr += "<table>"
        "<tr>"
        "<th>Flow rate:</th>"
        "<td>";
  ptr += int(flowRate1); // Print the integer part of the variable
  ptr += "."; // Print the decimal point
  // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
  frac = (flowRate1 - int(flowRate1)) * 10;
  ptr += frac; // Print the fractional part of the variable
  ptr += " L/min</td>"
        "</tr>"
        "<tr>"
        "<th>Current Liquid Flowing:</th>"
        "<td>";
  ptr += flowMilliLitres1;
  ptr += " mL/Sec</td>"
        "</tr>"
        "<tr>"
        "<th>Output Liquid Quantity:</th>"
        "<td>";
  ptr += totalMilliLitres1;
  ptr += " mL</td>"
        "</tr>"
        "<tr>"
        "<td colspan=\"2\" class=\"settings-cell\">";

