machv/esp8266-irrigator/src/main.cpp
  // Web server pages
  server.on("/", handle_OnConnect);
  server.on("/config", HTTP_GET, handle_pageConfig);
  server.on("/config", HTTP_POST, handle_saveConfig);
  server.on("/toggle", handle_toggle);
  server.on("/style.css", handle_stylesheetFile);
  server.onNotFound(handle_NotFound);  
  server.begin();
  Serial.println("HTTP server started");
}

void loop() {
  // Process web server requests
  server.handleClient();
  
  // MQTT reconnect if no connection with delay
  if(!mqttClient.connected() && ((millis() - lastMqttConnectionRetryTime) > mqttReconnectDelay)) {
    setupMqtt(1);
  }
  
  // Process MQTT communication
  mqttClient.loop();
  
  // Continuously read the status of the button. 
	button1.read();
  button2.read();

  // Process water flow sensors
  if((millis() - oldTime) > 1000) // Only process counters once per second
  {
    // Disable the interrupt while calculating flow rate and sending the value to the host
    detachInterrupt(PinMeter1);
    detachInterrupt(PinMeter2);

    // Because this loop may not complete in exactly 1 second intervals we calculate
    // the number of milliseconds that have passed since the last execution and use
    // that to scale the output. We also apply the calibrationFactor to scale the output
    // based on the number of pulses per second per units of measure (litres/minute in
    // this case) coming from the sensor.
    flowRate1 = ((1000.0 / (millis() - oldTime)) * pulseCounterMeter1) / calibrationFactor;
    flowRate2 = ((1000.0 / (millis() - oldTime)) * pulseCounterMeter2) / calibrationFactor;

    // Note the time this processing pass was executed. Note that because we've
    // disabled interrupts the millis() function won't actually be incrementing right
    // at this point, but it will still return the value it was set to just before
    // interrupts went away.
    oldTime = millis();

    // Divide the flow rate in litres/minute by 60 to determine how many litres have
    // passed through the sensor in this 1 second interval, then multiply by 1000 to
    // convert to millilitres.
    flowMilliLitres1 = (flowRate1 / 60) * 1000;
    flowMilliLitres2 = (flowRate2 / 60) * 1000;

    // Add the millilitres passed in this second to the cumulative total
    totalMilliLitres1 += flowMilliLitres1;
    totalMilliLitres2 += flowMilliLitres2;

    unsigned int frac;

    if(flowRate1 > 0) {
      // Print the flow rate for this second in litres / minute
      Serial.print("[Valve 1] Flow rate: ");
      Serial.print(int(flowRate1)); // Print the integer part of the variable
      Serial.print("."); // Print the decimal point
      // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
      frac = (flowRate1 - int(flowRate1)) * 10;
      Serial.print(frac, DEC); // Print the fractional part of the variable
      Serial.print("L/min");
      // Print the number of litres flowed in this second
      Serial.print("  Current Liquid Flowing: "); // Output separator
      Serial.print(flowMilliLitres1);
      Serial.print("mL/Sec");

      // Print the cumulative total of litres flowed since starting
      Serial.print("  Output Liquid Quantity: "); // Output separator
      Serial.print(totalMilliLitres1);
      Serial.println("mL");
    }

    if(flowRate2) {
      // Print the flow rate for this second in litres / minute
      Serial.print("[Valve 2] Flow rate: ");
      Serial.print(int(flowRate2)); // Print the integer part of the variable
      Serial.print("."); // Print the decimal point
      // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
      frac = (flowRate2 - int(flowRate2)) * 10;
      Serial.print(frac, DEC); // Print the fractional part of the variable
      Serial.print("L/min");
      // Print the number of litres flowed in this second
      Serial.print("  Current Liquid Flowing: "); // Output separator
      Serial.print(flowMilliLitres2);
      Serial.print("mL/Sec");

      // Print the cumulative total of litres flowed since starting
      Serial.print("  Output Liquid Quantity: "); // Output separator
      Serial.print(totalMilliLitres2);
      Serial.println("mL");
    }

    if(mqttClient.connected()) {
      if(flowRate1 > 0) {
        String channelCurrent = String(config.mqtt_channel + "1/currentFlow");
        String valueCurrent = String(flowRate1);
        mqttClient.publish(channelCurrent.c_str(), valueCurrent.c_str());

        String channelTotal = String(config.mqtt_channel + "1/totalFlow");
        String valueTotal = String(totalMilliLitres1);
        mqttClient.publish(channelTotal.c_str(), valueTotal.c_str());
      }

      if(flowRate2 > 0) {
        String channelCurrent = String(config.mqtt_channel + "2/currentFlow");
        String valueCurrent = String(flowRate2);
        mqttClient.publish(channelCurrent.c_str(), valueCurrent.c_str());

        String channelTotal = String(config.mqtt_channel + "2/totalFlow");
        String valueTotal = String(totalMilliLitres2);
        mqttClient.publish(channelTotal.c_str(), valueTotal.c_str());
      }
    }

    // Reset the pulse counter so we can start incrementing again
    pulseCounterMeter1 = 0;
    pulseCounterMeter2 = 0;

    // Enable the interrupt again now that we've finished sending output
    attachInterrupt(digitalPinToInterrupt(PinMeter1), meter1_triggered, FALLING);
    attachInterrupt(digitalPinToInterrupt(PinMeter2), meter2_triggered, FALLING);
  }
  
}
